Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_reg.h
/**
 * \file IfxDmu_reg.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC39XA_ITS_V3.0.R0
 * Specification: DMU_AURIXTC3XX_its_MCSFR.xml
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Dmu_Cfg Dmu address
 * \ingroup IfxLld_Dmu
 * 
 * \defgroup IfxLld_Dmu_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Dmu_Cfg
 * 
 * \defgroup IfxLld_Dmu_Cfg_Dmu 2-DMU
 * \ingroup IfxLld_Dmu_Cfg
 * 
 */
#ifndef IFXDMU_REG_H
#define IFXDMU_REG_H 1
/******************************************************************************/
#include "IfxDmu_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Dmu_Cfg_BaseAddress
 * \{  */

/** \brief  DMU object */
#define MODULE_DMU /*lint --e(923)*/ (*(Ifx_DMU*)0xF8040000u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dmu_Cfg_Dmu
 * \{  */

/** \brief  FC, Access Enable Register 0 */
#define DMU_HF_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_ACCEN0*)0xF80400FCu)

/** \brief  F8, Access Enable Register 1 */
#define DMU_HF_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_ACCEN1*)0xF80400F8u)

/** \brief  50, Cranking Control Register */
#define DMU_HF_CCONTROL /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_CCONTROL*)0xF8040050u)

/** \brief  38, Clear Error Register */
#define DMU_HF_CLRE /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_CLRE*)0xF8040038u)

/** \brief  20, Flash Confirm Status Register 0 */
#define DMU_HF_CONFIRM0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_CONFIRM0*)0xF8040020u)

/** \brief  24, Flash Confirm Status Register 1 */
#define DMU_HF_CONFIRM1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_CONFIRM1*)0xF8040024u)

/** \brief  28, Flash Confirm Status Register 2 */
#define DMU_HF_CONFIRM2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_CONFIRM2*)0xF8040028u)

/** \brief  14, Flash Control Register */
#define DMU_HF_CONTROL /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_CONTROL*)0xF8040014u)

/** \brief  A0, DFLASH Size Configuration Register */
#define DMU_HF_DSIZE /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_DSIZE*)0xF80400A0u)

/** \brief  6C, DFLASH Wait Cycle Register */
#define DMU_HF_DWAIT /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_DWAIT*)0xF804006Cu)

/** \brief  48, DF0 ECC Control Register */
#define DMU_HF_ECCC /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_ECCC*)0xF8040048u)

/** \brief  40, DF0 ECC Read Register */
#define DMU_HF_ECCR /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_ECCR*)0xF8040040u)

/** \brief  44, DF0 ECC Status Register */
#define DMU_HF_ECCS /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_ECCS*)0xF8040044u)

/** \brief  4C, DF0 ECC Write Register */
#define DMU_HF_ECCW /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_ECCW*)0xF804004Cu)

/** \brief  30, Enable Error Interrupt Control Register */
#define DMU_HF_EER /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_EER*)0xF8040030u)

/** \brief  34, Error Status Register */
#define DMU_HF_ERRSR /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_ERRSR*)0xF8040034u)

/** \brief  8, Module Identification Register */
#define DMU_HF_ID /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_ID*)0xF8040008u)

/** \brief  F4, Margin Control Register */
#define DMU_HF_MARGIN /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_MARGIN*)0xF80400F4u)

/** \brief  18, Flash Operation Register */
#define DMU_HF_OPERATION /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_OPERATION*)0xF8040018u)

/** \brief  64, Power Control Register */
#define DMU_HF_PCONTROL /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PCONTROL*)0xF8040064u)

/** \brief  90, Debug Interface Protection Configuration */
#define DMU_HF_PROCONDBG /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PROCONDBG*)0xF8040090u)

/** \brief  88, DFLASH Protection Configuration */
#define DMU_HF_PROCONDF /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PROCONDF*)0xF8040088u)

/** \brief  80, PFLASH Protection Configuration */
#define DMU_HF_PROCONPF /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PROCONPF*)0xF8040080u)

/** \brief  8C, RAM Configuration */
#define DMU_HF_PROCONRAM /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PROCONRAM*)0xF804008Cu)

/** \brief  84, Tuning Protection Configuration */
#define DMU_HF_PROCONTP /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PROCONTP*)0xF8040084u)

/** \brief  74, DF0 User Mode Control */
#define DMU_HF_PROCONUSR /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PROCONUSR*)0xF8040074u)

/** \brief  1C, Flash Protection Status Register */
#define DMU_HF_PROTECT /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PROTECT*)0xF804001Cu)

/** \brief  B0, PFLASH Bank Size Configuration Register */
#define DMU_HF_PSIZE0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PSIZE*)0xF80400B0u)

/** \brief  B4, PFLASH Bank Size Configuration Register */
#define DMU_HF_PSIZE1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PSIZE*)0xF80400B4u)

/** \brief  B8, PFLASH Bank Size Configuration Register */
#define DMU_HF_PSIZE2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PSIZE*)0xF80400B8u)

/** \brief  BC, PFLASH Bank Size Configuration Register */
#define DMU_HF_PSIZE3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PSIZE*)0xF80400BCu)

/** \brief  C0, PFLASH Bank Size Configuration Register */
#define DMU_HF_PSIZE4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PSIZE*)0xF80400C0u)

/** \brief  C4, PFLASH Bank Size Configuration Register */
#define DMU_HF_PSIZE5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PSIZE*)0xF80400C4u)

/** \brief  60, Power Status Register */
#define DMU_HF_PSTATUS /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PSTATUS*)0xF8040060u)

