Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_reg.h
/** \brief  68, PFLASH Wait Cycle Register */
#define DMU_HF_PWAIT /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_PWAIT*)0xF8040068u)

/** \brief  10, Flash Status Register */
#define DMU_HF_STATUS /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_STATUS*)0xF8040010u)

/** \brief  F0, Suspend Control Register */
#define DMU_HF_SUSPEND /*lint --e(923)*/ (*(volatile Ifx_DMU_HF_SUSPEND*)0xF80400F0u)

/** \brief  10040, PFLASH Bank OTP Protection Configuration 0 */
#define DMU_HP_PROCON0_OTP0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP0*)0xF8050040u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_OTP0.
* To use register names with standard convension, please use DMU_HP_PROCON0_OTP0.
*/
#define	DMU_HP_PROCONOTP00	(DMU_HP_PROCON0_OTP0)

/** \brief  10044, PFLASH Bank OTP Protection Configuration 1 */
#define DMU_HP_PROCON0_OTP1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP1*)0xF8050044u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_OTP1.
* To use register names with standard convension, please use DMU_HP_PROCON0_OTP1.
*/
#define	DMU_HP_PROCONOTP01	(DMU_HP_PROCON0_OTP1)

/** \brief  10048, PFLASH Bank OTP Protection Configuration 2 */
#define DMU_HP_PROCON0_OTP2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP2*)0xF8050048u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_OTP2.
* To use register names with standard convension, please use DMU_HP_PROCON0_OTP2.
*/
#define	DMU_HP_PROCONOTP02	(DMU_HP_PROCON0_OTP2)

/** \brief  1004C, PFLASH Bank OTP Protection Configuration 3 */
#define DMU_HP_PROCON0_OTP3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP3*)0xF805004Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON0_OTP3.
* To use register names with standard convension, please use DMU_HP_PROCON0_OTP3.
*/
#define	DMU_HP_PROCONOTP03	(DMU_HP_PROCON0_OTP3)

/** \brief  10050, PFLASH Bank OTP Protection Configuration 4 */
#define DMU_HP_PROCON0_OTP4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP4*)0xF8050050u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_OTP4.
* To use register names with standard convension, please use DMU_HP_PROCON0_OTP4.
*/
#define	DMU_HP_PROCONOTP04	(DMU_HP_PROCON0_OTP4)

/** \brief  10054, PFLASH Bank OTP Protection Configuration 5 */
#define DMU_HP_PROCON0_OTP5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP5*)0xF8050054u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_OTP5.
* To use register names with standard convension, please use DMU_HP_PROCON0_OTP5.
*/
#define	DMU_HP_PROCONOTP05	(DMU_HP_PROCON0_OTP5)

/** \brief  10000, PFLASH Bank Protection Configuration 0 */
#define DMU_HP_PROCON0_P0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P0*)0xF8050000u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_P0.
* To use register names with standard convension, please use DMU_HP_PROCON0_P0.
*/
#define	DMU_HP_PROCONP00	(DMU_HP_PROCON0_P0)

/** \brief  10004, PFLASH Bank Protection Configuration 1 */
#define DMU_HP_PROCON0_P1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P1*)0xF8050004u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_P1.
* To use register names with standard convension, please use DMU_HP_PROCON0_P1.
*/
#define	DMU_HP_PROCONP01	(DMU_HP_PROCON0_P1)

/** \brief  10008, PFLASH Bank Protection Configuration 2 */
#define DMU_HP_PROCON0_P2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P2*)0xF8050008u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_P2.
* To use register names with standard convension, please use DMU_HP_PROCON0_P2.
*/
#define	DMU_HP_PROCONP02	(DMU_HP_PROCON0_P2)

/** \brief  1000C, PFLASH Bank Protection Configuration 3 */
#define DMU_HP_PROCON0_P3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P3*)0xF805000Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON0_P3.
* To use register names with standard convension, please use DMU_HP_PROCON0_P3.
*/
#define	DMU_HP_PROCONP03	(DMU_HP_PROCON0_P3)

/** \brief  10010, PFLASH Bank Protection Configuration 4 */
#define DMU_HP_PROCON0_P4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P4*)0xF8050010u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_P4.
* To use register names with standard convension, please use DMU_HP_PROCON0_P4.
*/
#define	DMU_HP_PROCONP04	(DMU_HP_PROCON0_P4)

/** \brief  10014, PFLASH Bank Protection Configuration 5 */
#define DMU_HP_PROCON0_P5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P5*)0xF8050014u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_P5.
* To use register names with standard convension, please use DMU_HP_PROCON0_P5.
*/
#define	DMU_HP_PROCONP05	(DMU_HP_PROCON0_P5)

/** \brief  10080, PFLASH Bank WOP Configuration 0 */
#define DMU_HP_PROCON0_WOP0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP0*)0xF8050080u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_WOP0.
* To use register names with standard convension, please use DMU_HP_PROCON0_WOP0.
*/
#define	DMU_HP_PROCONWOP00	(DMU_HP_PROCON0_WOP0)

/** \brief  10084, PFLASH Bank WOP Configuration 1 */
#define DMU_HP_PROCON0_WOP1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP1*)0xF8050084u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_WOP1.
* To use register names with standard convension, please use DMU_HP_PROCON0_WOP1.
*/
#define	DMU_HP_PROCONWOP01	(DMU_HP_PROCON0_WOP1)

/** \brief  10088, PFLASH Bank WOP Configuration 2 */
#define DMU_HP_PROCON0_WOP2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP2*)0xF8050088u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_WOP2.
* To use register names with standard convension, please use DMU_HP_PROCON0_WOP2.
*/
#define	DMU_HP_PROCONWOP02	(DMU_HP_PROCON0_WOP2)

/** \brief  1008C, PFLASH Bank WOP Configuration 3 */
#define DMU_HP_PROCON0_WOP3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP3*)0xF805008Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON0_WOP3.
* To use register names with standard convension, please use DMU_HP_PROCON0_WOP3.
*/
#define	DMU_HP_PROCONWOP03	(DMU_HP_PROCON0_WOP3)

/** \brief  10090, PFLASH Bank WOP Configuration 4 */
#define DMU_HP_PROCON0_WOP4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP4*)0xF8050090u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_WOP4.
* To use register names with standard convension, please use DMU_HP_PROCON0_WOP4.
*/
#define	DMU_HP_PROCONWOP04	(DMU_HP_PROCON0_WOP4)

/** \brief  10094, PFLASH Bank WOP Configuration 5 */
#define DMU_HP_PROCON0_WOP5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP5*)0xF8050094u)

/** Alias (User Manual Name) for DMU_HP_PROCON0_WOP5.
* To use register names with standard convension, please use DMU_HP_PROCON0_WOP5.
*/
#define	DMU_HP_PROCONWOP05	(DMU_HP_PROCON0_WOP5)

/** \brief  10140, PFLASH Bank OTP Protection Configuration 0 */
#define DMU_HP_PROCON1_OTP0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP0*)0xF8050140u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_OTP0.
* To use register names with standard convension, please use DMU_HP_PROCON1_OTP0.
*/
#define	DMU_HP_PROCONOTP10	(DMU_HP_PROCON1_OTP0)

/** \brief  10144, PFLASH Bank OTP Protection Configuration 1 */
#define DMU_HP_PROCON1_OTP1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP1*)0xF8050144u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_OTP1.
* To use register names with standard convension, please use DMU_HP_PROCON1_OTP1.
*/
#define	DMU_HP_PROCONOTP11	(DMU_HP_PROCON1_OTP1)

