Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_reg.h
/** \brief  10148, PFLASH Bank OTP Protection Configuration 2 */
#define DMU_HP_PROCON1_OTP2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP2*)0xF8050148u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_OTP2.
* To use register names with standard convension, please use DMU_HP_PROCON1_OTP2.
*/
#define	DMU_HP_PROCONOTP12	(DMU_HP_PROCON1_OTP2)

/** \brief  1014C, PFLASH Bank OTP Protection Configuration 3 */
#define DMU_HP_PROCON1_OTP3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP3*)0xF805014Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON1_OTP3.
* To use register names with standard convension, please use DMU_HP_PROCON1_OTP3.
*/
#define	DMU_HP_PROCONOTP13	(DMU_HP_PROCON1_OTP3)

/** \brief  10150, PFLASH Bank OTP Protection Configuration 4 */
#define DMU_HP_PROCON1_OTP4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP4*)0xF8050150u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_OTP4.
* To use register names with standard convension, please use DMU_HP_PROCON1_OTP4.
*/
#define	DMU_HP_PROCONOTP14	(DMU_HP_PROCON1_OTP4)

/** \brief  10154, PFLASH Bank OTP Protection Configuration 5 */
#define DMU_HP_PROCON1_OTP5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP5*)0xF8050154u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_OTP5.
* To use register names with standard convension, please use DMU_HP_PROCON1_OTP5.
*/
#define	DMU_HP_PROCONOTP15	(DMU_HP_PROCON1_OTP5)

/** \brief  10100, PFLASH Bank Protection Configuration 0 */
#define DMU_HP_PROCON1_P0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P0*)0xF8050100u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_P0.
* To use register names with standard convension, please use DMU_HP_PROCON1_P0.
*/
#define	DMU_HP_PROCONP10	(DMU_HP_PROCON1_P0)

/** \brief  10104, PFLASH Bank Protection Configuration 1 */
#define DMU_HP_PROCON1_P1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P1*)0xF8050104u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_P1.
* To use register names with standard convension, please use DMU_HP_PROCON1_P1.
*/
#define	DMU_HP_PROCONP11	(DMU_HP_PROCON1_P1)

/** \brief  10108, PFLASH Bank Protection Configuration 2 */
#define DMU_HP_PROCON1_P2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P2*)0xF8050108u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_P2.
* To use register names with standard convension, please use DMU_HP_PROCON1_P2.
*/
#define	DMU_HP_PROCONP12	(DMU_HP_PROCON1_P2)

/** \brief  1010C, PFLASH Bank Protection Configuration 3 */
#define DMU_HP_PROCON1_P3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P3*)0xF805010Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON1_P3.
* To use register names with standard convension, please use DMU_HP_PROCON1_P3.
*/
#define	DMU_HP_PROCONP13	(DMU_HP_PROCON1_P3)

/** \brief  10110, PFLASH Bank Protection Configuration 4 */
#define DMU_HP_PROCON1_P4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P4*)0xF8050110u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_P4.
* To use register names with standard convension, please use DMU_HP_PROCON1_P4.
*/
#define	DMU_HP_PROCONP14	(DMU_HP_PROCON1_P4)

/** \brief  10114, PFLASH Bank Protection Configuration 5 */
#define DMU_HP_PROCON1_P5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P5*)0xF8050114u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_P5.
* To use register names with standard convension, please use DMU_HP_PROCON1_P5.
*/
#define	DMU_HP_PROCONP15	(DMU_HP_PROCON1_P5)

/** \brief  10180, PFLASH Bank WOP Configuration 0 */
#define DMU_HP_PROCON1_WOP0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP0*)0xF8050180u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_WOP0.
* To use register names with standard convension, please use DMU_HP_PROCON1_WOP0.
*/
#define	DMU_HP_PROCONWOP10	(DMU_HP_PROCON1_WOP0)

/** \brief  10184, PFLASH Bank WOP Configuration 1 */
#define DMU_HP_PROCON1_WOP1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP1*)0xF8050184u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_WOP1.
* To use register names with standard convension, please use DMU_HP_PROCON1_WOP1.
*/
#define	DMU_HP_PROCONWOP11	(DMU_HP_PROCON1_WOP1)

/** \brief  10188, PFLASH Bank WOP Configuration 2 */
#define DMU_HP_PROCON1_WOP2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP2*)0xF8050188u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_WOP2.
* To use register names with standard convension, please use DMU_HP_PROCON1_WOP2.
*/
#define	DMU_HP_PROCONWOP12	(DMU_HP_PROCON1_WOP2)

/** \brief  1018C, PFLASH Bank WOP Configuration 3 */
#define DMU_HP_PROCON1_WOP3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP3*)0xF805018Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON1_WOP3.
* To use register names with standard convension, please use DMU_HP_PROCON1_WOP3.
*/
#define	DMU_HP_PROCONWOP13	(DMU_HP_PROCON1_WOP3)

/** \brief  10190, PFLASH Bank WOP Configuration 4 */
#define DMU_HP_PROCON1_WOP4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP4*)0xF8050190u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_WOP4.
* To use register names with standard convension, please use DMU_HP_PROCON1_WOP4.
*/
#define	DMU_HP_PROCONWOP14	(DMU_HP_PROCON1_WOP4)

/** \brief  10194, PFLASH Bank WOP Configuration 5 */
#define DMU_HP_PROCON1_WOP5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP5*)0xF8050194u)

/** Alias (User Manual Name) for DMU_HP_PROCON1_WOP5.
* To use register names with standard convension, please use DMU_HP_PROCON1_WOP5.
*/
#define	DMU_HP_PROCONWOP15	(DMU_HP_PROCON1_WOP5)

/** \brief  10240, PFLASH Bank OTP Protection Configuration 0 */
#define DMU_HP_PROCON2_OTP0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP0*)0xF8050240u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_OTP0.
* To use register names with standard convension, please use DMU_HP_PROCON2_OTP0.
*/
#define	DMU_HP_PROCONOTP20	(DMU_HP_PROCON2_OTP0)

/** \brief  10244, PFLASH Bank OTP Protection Configuration 1 */
#define DMU_HP_PROCON2_OTP1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP1*)0xF8050244u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_OTP1.
* To use register names with standard convension, please use DMU_HP_PROCON2_OTP1.
*/
#define	DMU_HP_PROCONOTP21	(DMU_HP_PROCON2_OTP1)

/** \brief  10248, PFLASH Bank OTP Protection Configuration 2 */
#define DMU_HP_PROCON2_OTP2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP2*)0xF8050248u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_OTP2.
* To use register names with standard convension, please use DMU_HP_PROCON2_OTP2.
*/
#define	DMU_HP_PROCONOTP22	(DMU_HP_PROCON2_OTP2)

/** \brief  1024C, PFLASH Bank OTP Protection Configuration 3 */
#define DMU_HP_PROCON2_OTP3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP3*)0xF805024Cu)

