Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_reg.h
/** Alias (User Manual Name) for DMU_HP_PROCON2_OTP3.
* To use register names with standard convension, please use DMU_HP_PROCON2_OTP3.
*/
#define	DMU_HP_PROCONOTP23	(DMU_HP_PROCON2_OTP3)

/** \brief  10250, PFLASH Bank OTP Protection Configuration 4 */
#define DMU_HP_PROCON2_OTP4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP4*)0xF8050250u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_OTP4.
* To use register names with standard convension, please use DMU_HP_PROCON2_OTP4.
*/
#define	DMU_HP_PROCONOTP24	(DMU_HP_PROCON2_OTP4)

/** \brief  10254, PFLASH Bank OTP Protection Configuration 5 */
#define DMU_HP_PROCON2_OTP5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP5*)0xF8050254u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_OTP5.
* To use register names with standard convension, please use DMU_HP_PROCON2_OTP5.
*/
#define	DMU_HP_PROCONOTP25	(DMU_HP_PROCON2_OTP5)

/** \brief  10200, PFLASH Bank Protection Configuration 0 */
#define DMU_HP_PROCON2_P0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P0*)0xF8050200u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_P0.
* To use register names with standard convension, please use DMU_HP_PROCON2_P0.
*/
#define	DMU_HP_PROCONP20	(DMU_HP_PROCON2_P0)

/** \brief  10204, PFLASH Bank Protection Configuration 1 */
#define DMU_HP_PROCON2_P1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P1*)0xF8050204u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_P1.
* To use register names with standard convension, please use DMU_HP_PROCON2_P1.
*/
#define	DMU_HP_PROCONP21	(DMU_HP_PROCON2_P1)

/** \brief  10208, PFLASH Bank Protection Configuration 2 */
#define DMU_HP_PROCON2_P2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P2*)0xF8050208u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_P2.
* To use register names with standard convension, please use DMU_HP_PROCON2_P2.
*/
#define	DMU_HP_PROCONP22	(DMU_HP_PROCON2_P2)

/** \brief  1020C, PFLASH Bank Protection Configuration 3 */
#define DMU_HP_PROCON2_P3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P3*)0xF805020Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON2_P3.
* To use register names with standard convension, please use DMU_HP_PROCON2_P3.
*/
#define	DMU_HP_PROCONP23	(DMU_HP_PROCON2_P3)

/** \brief  10210, PFLASH Bank Protection Configuration 4 */
#define DMU_HP_PROCON2_P4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P4*)0xF8050210u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_P4.
* To use register names with standard convension, please use DMU_HP_PROCON2_P4.
*/
#define	DMU_HP_PROCONP24	(DMU_HP_PROCON2_P4)

/** \brief  10214, PFLASH Bank Protection Configuration 5 */
#define DMU_HP_PROCON2_P5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P5*)0xF8050214u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_P5.
* To use register names with standard convension, please use DMU_HP_PROCON2_P5.
*/
#define	DMU_HP_PROCONP25	(DMU_HP_PROCON2_P5)

/** \brief  10280, PFLASH Bank WOP Configuration 0 */
#define DMU_HP_PROCON2_WOP0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP0*)0xF8050280u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_WOP0.
* To use register names with standard convension, please use DMU_HP_PROCON2_WOP0.
*/
#define	DMU_HP_PROCONWOP20	(DMU_HP_PROCON2_WOP0)

/** \brief  10284, PFLASH Bank WOP Configuration 1 */
#define DMU_HP_PROCON2_WOP1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP1*)0xF8050284u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_WOP1.
* To use register names with standard convension, please use DMU_HP_PROCON2_WOP1.
*/
#define	DMU_HP_PROCONWOP21	(DMU_HP_PROCON2_WOP1)

/** \brief  10288, PFLASH Bank WOP Configuration 2 */
#define DMU_HP_PROCON2_WOP2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP2*)0xF8050288u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_WOP2.
* To use register names with standard convension, please use DMU_HP_PROCON2_WOP2.
*/
#define	DMU_HP_PROCONWOP22	(DMU_HP_PROCON2_WOP2)

/** \brief  1028C, PFLASH Bank WOP Configuration 3 */
#define DMU_HP_PROCON2_WOP3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP3*)0xF805028Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON2_WOP3.
* To use register names with standard convension, please use DMU_HP_PROCON2_WOP3.
*/
#define	DMU_HP_PROCONWOP23	(DMU_HP_PROCON2_WOP3)

/** \brief  10290, PFLASH Bank WOP Configuration 4 */
#define DMU_HP_PROCON2_WOP4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP4*)0xF8050290u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_WOP4.
* To use register names with standard convension, please use DMU_HP_PROCON2_WOP4.
*/
#define	DMU_HP_PROCONWOP24	(DMU_HP_PROCON2_WOP4)

/** \brief  10294, PFLASH Bank WOP Configuration 5 */
#define DMU_HP_PROCON2_WOP5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP5*)0xF8050294u)

/** Alias (User Manual Name) for DMU_HP_PROCON2_WOP5.
* To use register names with standard convension, please use DMU_HP_PROCON2_WOP5.
*/
#define	DMU_HP_PROCONWOP25	(DMU_HP_PROCON2_WOP5)

/** \brief  10340, PFLASH Bank OTP Protection Configuration 0 */
#define DMU_HP_PROCON3_OTP0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP0*)0xF8050340u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_OTP0.
* To use register names with standard convension, please use DMU_HP_PROCON3_OTP0.
*/
#define	DMU_HP_PROCONOTP30	(DMU_HP_PROCON3_OTP0)

/** \brief  10344, PFLASH Bank OTP Protection Configuration 1 */
#define DMU_HP_PROCON3_OTP1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP1*)0xF8050344u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_OTP1.
* To use register names with standard convension, please use DMU_HP_PROCON3_OTP1.
*/
#define	DMU_HP_PROCONOTP31	(DMU_HP_PROCON3_OTP1)

/** \brief  10348, PFLASH Bank OTP Protection Configuration 2 */
#define DMU_HP_PROCON3_OTP2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP2*)0xF8050348u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_OTP2.
* To use register names with standard convension, please use DMU_HP_PROCON3_OTP2.
*/
#define	DMU_HP_PROCONOTP32	(DMU_HP_PROCON3_OTP2)

/** \brief  1034C, PFLASH Bank OTP Protection Configuration 3 */
#define DMU_HP_PROCON3_OTP3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP3*)0xF805034Cu)

