Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_reg.h
/** Alias (User Manual Name) for DMU_HP_PROCON3_OTP3.
* To use register names with standard convension, please use DMU_HP_PROCON3_OTP3.
*/
#define	DMU_HP_PROCONOTP33	(DMU_HP_PROCON3_OTP3)

/** \brief  10350, PFLASH Bank OTP Protection Configuration 4 */
#define DMU_HP_PROCON3_OTP4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP4*)0xF8050350u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_OTP4.
* To use register names with standard convension, please use DMU_HP_PROCON3_OTP4.
*/
#define	DMU_HP_PROCONOTP34	(DMU_HP_PROCON3_OTP4)

/** \brief  10354, PFLASH Bank OTP Protection Configuration 5 */
#define DMU_HP_PROCON3_OTP5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP5*)0xF8050354u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_OTP5.
* To use register names with standard convension, please use DMU_HP_PROCON3_OTP5.
*/
#define	DMU_HP_PROCONOTP35	(DMU_HP_PROCON3_OTP5)

/** \brief  10300, PFLASH Bank Protection Configuration 0 */
#define DMU_HP_PROCON3_P0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P0*)0xF8050300u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_P0.
* To use register names with standard convension, please use DMU_HP_PROCON3_P0.
*/
#define	DMU_HP_PROCONP30	(DMU_HP_PROCON3_P0)

/** \brief  10304, PFLASH Bank Protection Configuration 1 */
#define DMU_HP_PROCON3_P1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P1*)0xF8050304u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_P1.
* To use register names with standard convension, please use DMU_HP_PROCON3_P1.
*/
#define	DMU_HP_PROCONP31	(DMU_HP_PROCON3_P1)

/** \brief  10308, PFLASH Bank Protection Configuration 2 */
#define DMU_HP_PROCON3_P2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P2*)0xF8050308u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_P2.
* To use register names with standard convension, please use DMU_HP_PROCON3_P2.
*/
#define	DMU_HP_PROCONP32	(DMU_HP_PROCON3_P2)

/** \brief  1030C, PFLASH Bank Protection Configuration 3 */
#define DMU_HP_PROCON3_P3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P3*)0xF805030Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON3_P3.
* To use register names with standard convension, please use DMU_HP_PROCON3_P3.
*/
#define	DMU_HP_PROCONP33	(DMU_HP_PROCON3_P3)

/** \brief  10310, PFLASH Bank Protection Configuration 4 */
#define DMU_HP_PROCON3_P4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P4*)0xF8050310u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_P4.
* To use register names with standard convension, please use DMU_HP_PROCON3_P4.
*/
#define	DMU_HP_PROCONP34	(DMU_HP_PROCON3_P4)

/** \brief  10314, PFLASH Bank Protection Configuration 5 */
#define DMU_HP_PROCON3_P5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P5*)0xF8050314u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_P5.
* To use register names with standard convension, please use DMU_HP_PROCON3_P5.
*/
#define	DMU_HP_PROCONP35	(DMU_HP_PROCON3_P5)

/** \brief  10380, PFLASH Bank WOP Configuration 0 */
#define DMU_HP_PROCON3_WOP0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP0*)0xF8050380u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_WOP0.
* To use register names with standard convension, please use DMU_HP_PROCON3_WOP0.
*/
#define	DMU_HP_PROCONWOP30	(DMU_HP_PROCON3_WOP0)

/** \brief  10384, PFLASH Bank WOP Configuration 1 */
#define DMU_HP_PROCON3_WOP1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP1*)0xF8050384u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_WOP1.
* To use register names with standard convension, please use DMU_HP_PROCON3_WOP1.
*/
#define	DMU_HP_PROCONWOP31	(DMU_HP_PROCON3_WOP1)

/** \brief  10388, PFLASH Bank WOP Configuration 2 */
#define DMU_HP_PROCON3_WOP2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP2*)0xF8050388u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_WOP2.
* To use register names with standard convension, please use DMU_HP_PROCON3_WOP2.
*/
#define	DMU_HP_PROCONWOP32	(DMU_HP_PROCON3_WOP2)

/** \brief  1038C, PFLASH Bank WOP Configuration 3 */
#define DMU_HP_PROCON3_WOP3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP3*)0xF805038Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON3_WOP3.
* To use register names with standard convension, please use DMU_HP_PROCON3_WOP3.
*/
#define	DMU_HP_PROCONWOP33	(DMU_HP_PROCON3_WOP3)

/** \brief  10390, PFLASH Bank WOP Configuration 4 */
#define DMU_HP_PROCON3_WOP4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP4*)0xF8050390u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_WOP4.
* To use register names with standard convension, please use DMU_HP_PROCON3_WOP4.
*/
#define	DMU_HP_PROCONWOP34	(DMU_HP_PROCON3_WOP4)

/** \brief  10394, PFLASH Bank WOP Configuration 5 */
#define DMU_HP_PROCON3_WOP5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP5*)0xF8050394u)

/** Alias (User Manual Name) for DMU_HP_PROCON3_WOP5.
* To use register names with standard convension, please use DMU_HP_PROCON3_WOP5.
*/
#define	DMU_HP_PROCONWOP35	(DMU_HP_PROCON3_WOP5)

/** \brief  10440, PFLASH Bank OTP Protection Configuration 0 */
#define DMU_HP_PROCON4_OTP0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP0*)0xF8050440u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_OTP0.
* To use register names with standard convension, please use DMU_HP_PROCON4_OTP0.
*/
#define	DMU_HP_PROCONOTP40	(DMU_HP_PROCON4_OTP0)

/** \brief  10444, PFLASH Bank OTP Protection Configuration 1 */
#define DMU_HP_PROCON4_OTP1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP1*)0xF8050444u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_OTP1.
* To use register names with standard convension, please use DMU_HP_PROCON4_OTP1.
*/
#define	DMU_HP_PROCONOTP41	(DMU_HP_PROCON4_OTP1)

/** \brief  10448, PFLASH Bank OTP Protection Configuration 2 */
#define DMU_HP_PROCON4_OTP2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP2*)0xF8050448u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_OTP2.
* To use register names with standard convension, please use DMU_HP_PROCON4_OTP2.
*/
#define	DMU_HP_PROCONOTP42	(DMU_HP_PROCON4_OTP2)

/** \brief  1044C, PFLASH Bank OTP Protection Configuration 3 */
#define DMU_HP_PROCON4_OTP3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP3*)0xF805044Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON4_OTP3.
* To use register names with standard convension, please use DMU_HP_PROCON4_OTP3.
*/
#define	DMU_HP_PROCONOTP43	(DMU_HP_PROCON4_OTP3)

