Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_reg.h
/** \brief  10450, PFLASH Bank OTP Protection Configuration 4 */
#define DMU_HP_PROCON4_OTP4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP4*)0xF8050450u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_OTP4.
* To use register names with standard convension, please use DMU_HP_PROCON4_OTP4.
*/
#define	DMU_HP_PROCONOTP44	(DMU_HP_PROCON4_OTP4)

/** \brief  10454, PFLASH Bank OTP Protection Configuration 5 */
#define DMU_HP_PROCON4_OTP5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP5*)0xF8050454u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_OTP5.
* To use register names with standard convension, please use DMU_HP_PROCON4_OTP5.
*/
#define	DMU_HP_PROCONOTP45	(DMU_HP_PROCON4_OTP5)

/** \brief  10400, PFLASH Bank Protection Configuration 0 */
#define DMU_HP_PROCON4_P0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P0*)0xF8050400u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_P0.
* To use register names with standard convension, please use DMU_HP_PROCON4_P0.
*/
#define	DMU_HP_PROCONP40	(DMU_HP_PROCON4_P0)

/** \brief  10404, PFLASH Bank Protection Configuration 1 */
#define DMU_HP_PROCON4_P1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P1*)0xF8050404u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_P1.
* To use register names with standard convension, please use DMU_HP_PROCON4_P1.
*/
#define	DMU_HP_PROCONP41	(DMU_HP_PROCON4_P1)

/** \brief  10408, PFLASH Bank Protection Configuration 2 */
#define DMU_HP_PROCON4_P2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P2*)0xF8050408u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_P2.
* To use register names with standard convension, please use DMU_HP_PROCON4_P2.
*/
#define	DMU_HP_PROCONP42	(DMU_HP_PROCON4_P2)

/** \brief  1040C, PFLASH Bank Protection Configuration 3 */
#define DMU_HP_PROCON4_P3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P3*)0xF805040Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON4_P3.
* To use register names with standard convension, please use DMU_HP_PROCON4_P3.
*/
#define	DMU_HP_PROCONP43	(DMU_HP_PROCON4_P3)

/** \brief  10410, PFLASH Bank Protection Configuration 4 */
#define DMU_HP_PROCON4_P4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P4*)0xF8050410u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_P4.
* To use register names with standard convension, please use DMU_HP_PROCON4_P4.
*/
#define	DMU_HP_PROCONP44	(DMU_HP_PROCON4_P4)

/** \brief  10414, PFLASH Bank Protection Configuration 5 */
#define DMU_HP_PROCON4_P5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P5*)0xF8050414u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_P5.
* To use register names with standard convension, please use DMU_HP_PROCON4_P5.
*/
#define	DMU_HP_PROCONP45	(DMU_HP_PROCON4_P5)

/** \brief  10480, PFLASH Bank WOP Configuration 0 */
#define DMU_HP_PROCON4_WOP0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP0*)0xF8050480u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_WOP0.
* To use register names with standard convension, please use DMU_HP_PROCON4_WOP0.
*/
#define	DMU_HP_PROCONWOP40	(DMU_HP_PROCON4_WOP0)

/** \brief  10484, PFLASH Bank WOP Configuration 1 */
#define DMU_HP_PROCON4_WOP1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP1*)0xF8050484u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_WOP1.
* To use register names with standard convension, please use DMU_HP_PROCON4_WOP1.
*/
#define	DMU_HP_PROCONWOP41	(DMU_HP_PROCON4_WOP1)

/** \brief  10488, PFLASH Bank WOP Configuration 2 */
#define DMU_HP_PROCON4_WOP2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP2*)0xF8050488u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_WOP2.
* To use register names with standard convension, please use DMU_HP_PROCON4_WOP2.
*/
#define	DMU_HP_PROCONWOP42	(DMU_HP_PROCON4_WOP2)

/** \brief  1048C, PFLASH Bank WOP Configuration 3 */
#define DMU_HP_PROCON4_WOP3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP3*)0xF805048Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON4_WOP3.
* To use register names with standard convension, please use DMU_HP_PROCON4_WOP3.
*/
#define	DMU_HP_PROCONWOP43	(DMU_HP_PROCON4_WOP3)

/** \brief  10490, PFLASH Bank WOP Configuration 4 */
#define DMU_HP_PROCON4_WOP4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP4*)0xF8050490u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_WOP4.
* To use register names with standard convension, please use DMU_HP_PROCON4_WOP4.
*/
#define	DMU_HP_PROCONWOP44	(DMU_HP_PROCON4_WOP4)

/** \brief  10494, PFLASH Bank WOP Configuration 5 */
#define DMU_HP_PROCON4_WOP5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP5*)0xF8050494u)

/** Alias (User Manual Name) for DMU_HP_PROCON4_WOP5.
* To use register names with standard convension, please use DMU_HP_PROCON4_WOP5.
*/
#define	DMU_HP_PROCONWOP45	(DMU_HP_PROCON4_WOP5)

/** \brief  10540, PFLASH Bank OTP Protection Configuration 0 */
#define DMU_HP_PROCON5_OTP0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP0*)0xF8050540u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_OTP0.
* To use register names with standard convension, please use DMU_HP_PROCON5_OTP0.
*/
#define	DMU_HP_PROCONOTP50	(DMU_HP_PROCON5_OTP0)

/** \brief  10544, PFLASH Bank OTP Protection Configuration 1 */
#define DMU_HP_PROCON5_OTP1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP1*)0xF8050544u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_OTP1.
* To use register names with standard convension, please use DMU_HP_PROCON5_OTP1.
*/
#define	DMU_HP_PROCONOTP51	(DMU_HP_PROCON5_OTP1)

/** \brief  10548, PFLASH Bank OTP Protection Configuration 2 */
#define DMU_HP_PROCON5_OTP2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP2*)0xF8050548u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_OTP2.
* To use register names with standard convension, please use DMU_HP_PROCON5_OTP2.
*/
#define	DMU_HP_PROCONOTP52	(DMU_HP_PROCON5_OTP2)

/** \brief  1054C, PFLASH Bank OTP Protection Configuration 3 */
#define DMU_HP_PROCON5_OTP3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP3*)0xF805054Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON5_OTP3.
* To use register names with standard convension, please use DMU_HP_PROCON5_OTP3.
*/
#define	DMU_HP_PROCONOTP53	(DMU_HP_PROCON5_OTP3)

/** \brief  10550, PFLASH Bank OTP Protection Configuration 4 */
#define DMU_HP_PROCON5_OTP4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP4*)0xF8050550u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_OTP4.
* To use register names with standard convension, please use DMU_HP_PROCON5_OTP4.
*/
#define	DMU_HP_PROCONOTP54	(DMU_HP_PROCON5_OTP4)

