Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxDmu_reg.h
/** \brief  10554, PFLASH Bank OTP Protection Configuration 5 */
#define DMU_HP_PROCON5_OTP5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_OTP5*)0xF8050554u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_OTP5.
* To use register names with standard convension, please use DMU_HP_PROCON5_OTP5.
*/
#define	DMU_HP_PROCONOTP55	(DMU_HP_PROCON5_OTP5)

/** \brief  10500, PFLASH Bank Protection Configuration 0 */
#define DMU_HP_PROCON5_P0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P0*)0xF8050500u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_P0.
* To use register names with standard convension, please use DMU_HP_PROCON5_P0.
*/
#define	DMU_HP_PROCONP50	(DMU_HP_PROCON5_P0)

/** \brief  10504, PFLASH Bank Protection Configuration 1 */
#define DMU_HP_PROCON5_P1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P1*)0xF8050504u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_P1.
* To use register names with standard convension, please use DMU_HP_PROCON5_P1.
*/
#define	DMU_HP_PROCONP51	(DMU_HP_PROCON5_P1)

/** \brief  10508, PFLASH Bank Protection Configuration 2 */
#define DMU_HP_PROCON5_P2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P2*)0xF8050508u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_P2.
* To use register names with standard convension, please use DMU_HP_PROCON5_P2.
*/
#define	DMU_HP_PROCONP52	(DMU_HP_PROCON5_P2)

/** \brief  1050C, PFLASH Bank Protection Configuration 3 */
#define DMU_HP_PROCON5_P3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P3*)0xF805050Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON5_P3.
* To use register names with standard convension, please use DMU_HP_PROCON5_P3.
*/
#define	DMU_HP_PROCONP53	(DMU_HP_PROCON5_P3)

/** \brief  10510, PFLASH Bank Protection Configuration 4 */
#define DMU_HP_PROCON5_P4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P4*)0xF8050510u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_P4.
* To use register names with standard convension, please use DMU_HP_PROCON5_P4.
*/
#define	DMU_HP_PROCONP54	(DMU_HP_PROCON5_P4)

/** \brief  10514, PFLASH Bank Protection Configuration 5 */
#define DMU_HP_PROCON5_P5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_P5*)0xF8050514u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_P5.
* To use register names with standard convension, please use DMU_HP_PROCON5_P5.
*/
#define	DMU_HP_PROCONP55	(DMU_HP_PROCON5_P5)

/** \brief  10580, PFLASH Bank WOP Configuration 0 */
#define DMU_HP_PROCON5_WOP0 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP0*)0xF8050580u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_WOP0.
* To use register names with standard convension, please use DMU_HP_PROCON5_WOP0.
*/
#define	DMU_HP_PROCONWOP50	(DMU_HP_PROCON5_WOP0)

/** \brief  10584, PFLASH Bank WOP Configuration 1 */
#define DMU_HP_PROCON5_WOP1 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP1*)0xF8050584u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_WOP1.
* To use register names with standard convension, please use DMU_HP_PROCON5_WOP1.
*/
#define	DMU_HP_PROCONWOP51	(DMU_HP_PROCON5_WOP1)

/** \brief  10588, PFLASH Bank WOP Configuration 2 */
#define DMU_HP_PROCON5_WOP2 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP2*)0xF8050588u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_WOP2.
* To use register names with standard convension, please use DMU_HP_PROCON5_WOP2.
*/
#define	DMU_HP_PROCONWOP52	(DMU_HP_PROCON5_WOP2)

/** \brief  1058C, PFLASH Bank WOP Configuration 3 */
#define DMU_HP_PROCON5_WOP3 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP3*)0xF805058Cu)

/** Alias (User Manual Name) for DMU_HP_PROCON5_WOP3.
* To use register names with standard convension, please use DMU_HP_PROCON5_WOP3.
*/
#define	DMU_HP_PROCONWOP53	(DMU_HP_PROCON5_WOP3)

/** \brief  10590, PFLASH Bank WOP Configuration 4 */
#define DMU_HP_PROCON5_WOP4 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP4*)0xF8050590u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_WOP4.
* To use register names with standard convension, please use DMU_HP_PROCON5_WOP4.
*/
#define	DMU_HP_PROCONWOP54	(DMU_HP_PROCON5_WOP4)

/** \brief  10594, PFLASH Bank WOP Configuration 5 */
#define DMU_HP_PROCON5_WOP5 /*lint --e(923)*/ (*(volatile Ifx_DMU_HP_PROCON_WOP5*)0xF8050594u)

/** Alias (User Manual Name) for DMU_HP_PROCON5_WOP5.
* To use register names with standard convension, please use DMU_HP_PROCON5_WOP5.
*/
#define	DMU_HP_PROCONWOP55	(DMU_HP_PROCON5_WOP5)

/** \brief  20038, Clear Error Register */
#define DMU_SF_CLRE /*lint --e(923)*/ (*(volatile Ifx_DMU_SF_CLRE*)0xF8060038u)

/** \brief  20014, HSM Flash Configuration Register */
#define DMU_SF_CONTROL /*lint --e(923)*/ (*(volatile Ifx_DMU_SF_CONTROL*)0xF8060014u)

/** \brief  20048, DF1 ECC Control Register */
#define DMU_SF_ECCC /*lint --e(923)*/ (*(volatile Ifx_DMU_SF_ECCC*)0xF8060048u)

/** \brief  20040, DF1 ECC Read Register */
#define DMU_SF_ECCR /*lint --e(923)*/ (*(volatile Ifx_DMU_SF_ECCR*)0xF8060040u)

/** \brief  20044, DF1 ECC Status Register */
#define DMU_SF_ECCS /*lint --e(923)*/ (*(volatile Ifx_DMU_SF_ECCS*)0xF8060044u)

/** \brief  2004C, DF1 ECC Write Register */
#define DMU_SF_ECCW /*lint --e(923)*/ (*(volatile Ifx_DMU_SF_ECCW*)0xF806004Cu)

/** \brief  20030, HSM Enable Error Interrupt Control Register */
#define DMU_SF_EER /*lint --e(923)*/ (*(volatile Ifx_DMU_SF_EER*)0xF8060030u)

/** \brief  20034, HSM Error Status Register */
#define DMU_SF_ERRSR /*lint --e(923)*/ (*(volatile Ifx_DMU_SF_ERRSR*)0xF8060034u)

/** \brief  200EC, DF1 Margin Control Register */
#define DMU_SF_MARGIN /*lint --e(923)*/ (*(volatile Ifx_DMU_SF_MARGIN*)0xF80600ECu)

/** \brief  20018, Flash Operation Register */
#define DMU_SF_OPERATION /*lint --e(923)*/ (*(volatile Ifx_DMU_SF_OPERATION*)0xF8060018u)

/** \brief  20074, DF1 User Mode Control */
#define DMU_SF_PROCONUSR /*lint --e(923)*/ (*(volatile Ifx_DMU_SF_PROCONUSR*)0xF8060074u)

/** \brief  20010, HSM Flash Status Register */
#define DMU_SF_STATUS /*lint --e(923)*/ (*(volatile Ifx_DMU_SF_STATUS*)0xF8060010u)

/** \brief  200E8, HSM Suspend Control Register */
#define DMU_SF_SUSPEND /*lint --e(923)*/ (*(volatile Ifx_DMU_SF_SUSPEND*)0xF80600E8u)

/** \brief  30040, HSM Interface Protection Configuration */
#define DMU_SP_PROCONHSM /*lint --e(923)*/ (*(volatile Ifx_DMU_SP_PROCONHSM*)0xF8070040u)

/** \brief  30004, HSM Code Boot Sector */
#define DMU_SP_PROCONHSMCBS /*lint --e(923)*/ (*(volatile Ifx_DMU_SP_PROCONHSMCBS*)0xF8070004u)

/** \brief  30000, HSM Protection Configuration */
#define DMU_SP_PROCONHSMCFG /*lint --e(923)*/ (*(volatile Ifx_DMU_SP_PROCONHSMCFG*)0xF8070000u)

/** \brief  30010, HSM Code OTP Protection Configuration */
#define DMU_SP_PROCONHSMCOTP0 /*lint --e(923)*/ (*(volatile Ifx_DMU_SP_PROCONHSMCOTP0*)0xF8070010u)

/** \brief  30014, HSM Code OTP Protection Configuration */
#define DMU_SP_PROCONHSMCOTP1 /*lint --e(923)*/ (*(volatile Ifx_DMU_SP_PROCONHSMCOTP1*)0xF8070014u)

/** \brief  30008, HSM Code Exclusive Protection Configuration */
#define DMU_SP_PROCONHSMCX0 /*lint --e(923)*/ (*(volatile Ifx_DMU_SP_PROCONHSMCX0*)0xF8070008u)

/** \brief  3000C, HSM Code Exclusive Protection Configuration */
#define DMU_SP_PROCONHSMCX1 /*lint --e(923)*/ (*(volatile Ifx_DMU_SP_PROCONHSMCX1*)0xF807000Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXDMU_REG_H */
